src/InformationRegisters/ИсторияЗаявокПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗаявокПокупателя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСтрокДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаявкиПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаписейРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПрихода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПодсистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодсистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИсточникиЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ИсточникиЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СайтОпт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СайтРозница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Inventor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнойВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_4RM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ИсторияЗаявокПокупателя/Ext/ManagerModule.bsl
Процедура ДобавитьДанныеИсторияЗаявокПокупателя(Список, НомерСообщения, СтруктураХранения) Экспорт
	лКлючАлгоритма = "РегистрСведений_ИсторияЗаявокПокупателя_МодульМенеджера_ДобавитьДанныеИсторияЗаявокПокупателя";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////	
	
	Если НЕ РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт","Выгружать историю строк заявок", Ложь) Тогда
		Возврат;
	КонецЕсли;

	УстанавливаемыеПоля = Новый Структура;
	УстанавливаемыеПоля.Вставить("НомерСообщенияОтправленного", НомерСообщения);
	УстанавливаемыеПоля.Вставить("ДатаОтправки", ТекущаяДата());
	
	КлючевыеПоля = Новый Структура;
	КлючевыеПоля.Вставить("Период");	
	КлючевыеПоля.Вставить("Регистратор");	
	КлючевыеПоля.Вставить("НомерСтроки");	
	КлючевыеПоля.Вставить("СтрокаЗаявки");	
	КлючевыеПоля.Вставить("СтрокаПрихода");	
	КлючевыеПоля.Вставить("Отказ");	
	КлючевыеПоля.Вставить("Порядок");	
	
	Структура = Новый Структура("ИмяТаблицы", "РегистрСведений.ИсторияЗаявокПокупателя");
	Структура.Вставить("КлючевыеПоля", КлючевыеПоля);
	Структура.Вставить("УстанавливаемыеПоля", УстанавливаемыеПоля);
	
	Структура.Вставить("СтруктураХранения", СтруктураХранения);

	РаботаСSQL.УстановитьИменаПолей(Структура);
	РаботаСSQL.УстановитьПоляSet(Структура);
	ВнутренняяТаблица = "";
	
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://ws-02.part-kom.ru/partkom83/hs/SiteExchange/XMLSchema", "ИсторияСтрокЗаявок");
	ВыборкаИсторииСтрокЗаявок = ВыборкаИсторииСтрокЗаявок();
	ТаблицаОтбора = "";
	
	Пока ВыборкаИсторииСтрокЗаявок.Следующий() Цикл
		
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
		ЗаполнитьЗначенияСвойств(ОбъектXDTO, ВыборкаИсторииСтрокЗаявок, "IDSite,Количество,НомерЗаявки,Артикул,Цена,ЗакупочнаяЦена,Розница");
		ОбъектXDTO.IDHistory = ВыборкаИсторииСтрокЗаявок.Документ.УникальныйИдентификатор();
		ОбъектXDTO.Состояние = ВыборкаИсторииСтрокЗаявок.Состояние.УникальныйИдентификатор();
		ОбъектXDTO.ВерсияДанных = ВыборкаИсторииСтрокЗаявок.Период;
		ОбъектXDTO.Склад = ВыборкаИсторииСтрокЗаявок.Склад.УникальныйИдентификатор();
		ОбъектXDTO.ТипДоставки   =  ВыборкаИсторииСтрокЗаявок.ТипДоставки.УникальныйИдентификатор();
		Список.Добавить(ОбъектXDTO);
		
		ВнутренняяТаблица = ВнутренняяТаблица + ?(ВнутренняяТаблица = "", "", ",") + "(" + 
							РаботаСSQL.ЗначениеSQL(ВыборкаИсторииСтрокЗаявок.Период) + "," + 
							РаботаСSQL.ЗначениеSQL(ВыборкаИсторииСтрокЗаявок.Регистратор) + "," + 
							РаботаСSQL.ЗначениеSQL(ВыборкаИсторииСтрокЗаявок.НомерСтроки) + "," + 
							РаботаСSQL.ЗначениеSQL(ВыборкаИсторииСтрокЗаявок.СтрокаЗаявки) + "," + 
							РаботаСSQL.ЗначениеSQL(ВыборкаИсторииСтрокЗаявок.СтрокаПрихода) + "," + 
							РаботаСSQL.ЗначениеSQL(ВыборкаИсторииСтрокЗаявок.Отказ) + "," + 
							РаботаСSQL.ЗначениеSQL(ВыборкаИсторииСтрокЗаявок.Порядок) + ")";
		
	КонецЦикла;
	
	
	СтрокаJoin =	Структура.Поля["Период"] + "=t.f1 and " +
					Структура.Поля["Регистратор"] + "=t.f2 and " +
					Структура.Поля["НомерСтроки"] + "=t.f3 and " +
					Структура.Поля["СтрокаЗаявки"] + "=t.f4 and " +
					Структура.Поля["СтрокаПрихода"] + "=t.f5 and " +
					Структура.Поля["Отказ"] + "=t.f6 and " +
					Структура.Поля["Порядок"] + "=t.f7";
	ВнутренняяТаблица =  " inner join " + Символы.ПС + "(values" + ВнутренняяТаблица + ") t (f1,f2,f3,f4,f5,f6,f7) on " + СтрокаJoin;;
	Структура.Вставить("ВнутренняяТаблица", ВнутренняяТаблица);
	ТекстЗапроса = "update " + Структура.ИмяТаблицыХранения + Структура.Set + "from " + Структура.ИмяТаблицыХранения + ВнутренняяТаблица;
	
	ОписаниеОшибки = РаботаСSQL.ВыполнитьЗапросSQL(ТекстЗапроса);
	
КонецПроцедуры
Функция ВыборкаИсторииСтрокЗаявок()
	лКлючАлгоритма = "РегистрСведений_ИсторияЗаявокПокупателя_МодульМенеджера_ВыборкаИсторииСтрокЗаявок";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////
	
	КоличествоОбъектов = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)","Количество объектов в обмене", 1000);
	ОбратныйПорядокВыборки = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)","Обратный порядок выборки", Истина);
	УсловиеОтбора = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)","Условие запроса истории строк заявок", "");
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1234
	                      |	ИсторияЗаявокПокупателя.IDSite,
	                      |	ИсторияЗаявокПокупателя.Период КАК Период,
	                      |	ВЫБОР
	                      |		КОГДА ИсторияЗаявокПокупателя.СтрокаЗаявки.Заявка.ИсточникЗаявки = ЗНАЧЕНИЕ(Перечисление.ИсточникиЗаявок.СайтРозница)
	                      |			ТОГДА ЕСТЬNULL(ИсторияЗаявокПокупателя.СтрокаЗаявки.Заявка.НомерРозничнойЗаявки, """")
	                      |		ИНАЧЕ ЕСТЬNULL(ИсторияЗаявокПокупателя.СтрокаЗаявки.Заявка.Номер, """")
	                      |	КОНЕЦ КАК НомерЗаявки,
	                      |	ИсторияЗаявокПокупателя.Склад,
	                      |	ИсторияЗаявокПокупателя.Количество,
	                      |	ЕСТЬNULL(ИсторияЗаявокПокупателя.СтрокаЗаявки.Цена, 0) КАК Цена,
	                      |	ИсторияЗаявокПокупателя.СтрокаЗаявки,
	                      |	ЕСТЬNULL(ИсторияЗаявокПокупателя.СтрокаЗаявки.ЦенаЗакупки, 0) КАК ЗакупочнаяЦена,
	                      |	ИсторияЗаявокПокупателя.Состояние,
	                      |	ИсторияЗаявокПокупателя.СтрокаПрихода,
	                      |	ИсторияЗаявокПокупателя.Отказ,
	                      |	ИсторияЗаявокПокупателя.Порядок,
	                      |	ИсторияЗаявокПокупателя.ДатаСобытия КАК ДатаСобытия,
	                      |	ИсторияЗаявокПокупателя.Номенклатура,
	                      |	ИсторияЗаявокПокупателя.Регистратор,
	                      |	ИсторияЗаявокПокупателя.НомерСтроки,
	                      |	ЕСТЬNULL(ИсторияЗаявокПокупателя.Номенклатура.Артикул, """") КАК Артикул,
	                      |	ВЫБОР
	                      |		КОГДА ИсторияЗаявокПокупателя.СтрокаЗаявки.Заявка.ИсточникЗаявки = ЗНАЧЕНИЕ(Перечисление.ИсточникиЗаявок.СайтРозница)
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК Розница,
	                      |	ИсторияЗаявокПокупателя.Регистратор КАК Документ,
	                      |	ВЫБОР
	                      |		КОГДА ИсторияЗаявокПокупателя.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	                      |			ТОГДА ВЫРАЗИТЬ(ИсторияЗаявокПокупателя.Регистратор КАК Документ.РеализацияТоваровУслуг).ТипДоставки
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТипыДоставки.ПустаяСсылка)
	                      |	КОНЕЦ КАК ТипДоставки
	                      |ИЗ
	                      |	РегистрСведений.ИсторияЗаявокПокупателя КАК ИсторияЗаявокПокупателя
	                      |ГДЕ
	                      |	НЕ ИсторияЗаявокПокупателя.ПолученоСайтом
	                      |	И ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаСобытия УБЫВ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1234", Формат(КоличествоОбъектов, "ЧГ="));
	Если НЕ ОбратныйПорядокВыборки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, " УБЫВ", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "И " + УсловиеОтбора);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ФиксацияПринятогоСообщения(НомерСообщения, СтруктураХранения) Экспорт
	
	УстанавливаемыеПоля = Новый Структура;
	УстанавливаемыеПоля.Вставить("ПолученоСайтом", Истина);
	УстанавливаемыеПоля.Вставить("ДатаОбработкиСайтом", ТекущаяДата());

	ОтборПоНомеруСообщения = Новый Структура;
	ОтборПоНомеруСообщения.Вставить("ВидСравнения", ВидСравнения.Интервал);
	ОтборПоНомеруСообщения.Вставить("Минимум", 1);
	ОтборПоНомеруСообщения.Вставить("Максимум", НомерСообщения);
	
	ПоляОтбора = Новый Структура;
	ПоляОтбора.Вставить("НомерСообщенияОтправленного", ОтборПоНомеруСообщения);
	ПоляОтбора.Вставить("ПолученоСайтом", Ложь);
	
	Структура = Новый Структура("ИмяТаблицы", "РегистрСведений.ИсторияЗаявокПокупателя");
	Структура.Вставить("УстанавливаемыеПоля", УстанавливаемыеПоля);
	Структура.Вставить("ПоляОтбора", ПоляОтбора);
	Структура.Вставить("СтруктураХранения", СтруктураХранения);
	
	ОписаниеОшибки = РаботаСSQL.UpdateAtWhere(Структура);
	
КонецПроцедуры

Процедура СнятьРегистрациюСЗаписей(Выборка) Экспорт
	
	УстанавливаемыеПоля = Новый Структура;
	УстанавливаемыеПоля.Вставить("НомерСообщенияОтправленного", 0);
	УстанавливаемыеПоля.Вставить("ДатаОтправки", '00010101');
	УстанавливаемыеПоля.Вставить("ДатаОбработкиСайтом", '00010101');
	УстанавливаемыеПоля.Вставить("ПолученоСайтом", Ложь);
	
	КлючевыеПоля = Новый Структура;
	КлючевыеПоля.Вставить("Период");	
	КлючевыеПоля.Вставить("Регистратор");	
	КлючевыеПоля.Вставить("НомерСтроки");	
	КлючевыеПоля.Вставить("СтрокаЗаявки");	
	КлючевыеПоля.Вставить("СтрокаПрихода");	
	КлючевыеПоля.Вставить("Отказ");	
	КлючевыеПоля.Вставить("Порядок");	
	
	Структура = Новый Структура("ИмяТаблицы", "РегистрСведений.ИсторияЗаявокПокупателя");
	Структура.Вставить("КлючевыеПоля", КлючевыеПоля);
	Структура.Вставить("УстанавливаемыеПоля", УстанавливаемыеПоля);
	Структура.Вставить("ВыборкаДанных", Выборка);
	
	ОписаниеОшибки = РаботаСSQL.UpdateAtJOIN(Структура);
	
КонецПроцедуры

Процедура ОтметитьЗаписиКакВыгруженные(Выборка) Экспорт
	
	УстанавливаемыеПоля = Новый Структура;
	УстанавливаемыеПоля.Вставить("НомерСообщенияОтправленного", 0);
	УстанавливаемыеПоля.Вставить("ДатаОтправки", ТекущаяДата());
	УстанавливаемыеПоля.Вставить("ДатаОбработкиСайтом", ТекущаяДата());
	УстанавливаемыеПоля.Вставить("ПолученоСайтом", Истина);
	
	КлючевыеПоля = Новый Структура;
	КлючевыеПоля.Вставить("Период");	
	КлючевыеПоля.Вставить("Регистратор");	
	КлючевыеПоля.Вставить("НомерСтроки");	
	КлючевыеПоля.Вставить("СтрокаЗаявки");	
	КлючевыеПоля.Вставить("СтрокаПрихода");	
	КлючевыеПоля.Вставить("Отказ");	
	КлючевыеПоля.Вставить("Порядок");	
	
	Структура = Новый Структура("ИмяТаблицы", "РегистрСведений.ИсторияЗаявокПокупателя");
	Структура.Вставить("КлючевыеПоля", КлючевыеПоля);
	Структура.Вставить("УстанавливаемыеПоля", УстанавливаемыеПоля);
	Структура.Вставить("ВыборкаДанных", Выборка);
	
	ОписаниеОшибки = РаботаСSQL.UpdateAtJOIN(Структура);
	
КонецПроцедуры

Функция ИмяПоляТаблицы(ОписаниеПолей, ИмяПоля, Отказ)
	
	ИмяПоляХранения = "";	
	Строка = ОписаниеПолей.Найти(ИмяПоля, "ИмяПоля");
	Если Строка = Неопределено Тогда
		Отказ = Истина;
	Иначе
		ИмяПоляХранения = Строка.ИмяПоляХранения;
	КонецЕсли;
	
	Возврат ИмяПоляХранения;
	
КонецФункции
